"use client";

import { WebPreviewContext, WebPreviewContextType } from "@/context/webPreview.context";
import { Verified, Favorite, ReportGmailerrorredOutlined, ShareOutlined } from "@mui/icons-material";
import { Tooltip } from "antd";
import { useContext, useEffect } from "react";
import Image from "next/image";

export default function Page() {
  const { setBackground, setBreadCrump, setHeaderTitle, setSidebar, setHeaderSubTitle } = useContext(WebPreviewContext) as WebPreviewContextType;
  useEffect(() => {
    setBackground("bg-white");
    setBreadCrump([
      { title: "ایران اکازیون", url: "/" },
      { title: "ویلا", url: "/" },
      { title: "متل قو", url: "/" },
    ]);
    setSidebar({
      small: false,
      component: "Features/Estate/MapEstate",
      props: {},
    });
    setHeaderTitle("فروش ویلای خوب");
    setHeaderSubTitle({
      type: "blog",
      rating: true,
      rateScore: 4,
      // userRate: 2,
      sharing: true,
      report: true,
    });
  }, []);

  return (
    <>
      <div className="flex h-full flex-col justify-between">
        <div className="text-justify">
          {/* map estate */}
          {/* <div className="block h-60 w-full overflow-hidden rounded-lg xl:hidden">
          <MapEstate />
        </div> */}
          لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد
          گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان
          مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط
          فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد
          کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و
          با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا
          با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته
          اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای
          کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه
          راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و
          مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص
          طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم
          متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و
          آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز
          شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی
          تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در
          این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.{" "}
        </div>
        <div className="relative mt-3 w-full">
          <div className="flex items-center justify-center rounded-xl bg-gray-200 p-4">
            <div className="flex w-full max-w-2xl flex-col items-center justify-between gap-2 gap-y-4 lg:flex-row">
              {/* icons */}
              <div className="order-last grid h-full grid-cols-4 gap-2 lg:order-first lg:grid-cols-2">
                <Tooltip title="تایید شده" placement="top" arrow={false}>
                  <div role="verified" className="flex cursor-pointer items-center justify-center text-secondary">
                    <Verified style={{ fontSize: 28 }} />
                  </div>
                </Tooltip>
                <Tooltip title="افزودن به مورد علاقه ها" placement="top" arrow={false}>
                  <div role="add-to-favorites" className="flex cursor-pointer items-center justify-center  text-red-500">
                    {/* <FavoriteBorderOutlined style={{ fontSize: 28 }} /> */}
                    <Favorite style={{ fontSize: 28 }} />
                  </div>
                </Tooltip>
                <Tooltip title="گزارش مشکل" placement="top" arrow={false}>
                  <div role="report" className="flex cursor-pointer items-center justify-center text-gray-500">
                    <ReportGmailerrorredOutlined style={{ fontSize: 28 }} />
                  </div>
                </Tooltip>
                <Tooltip title="اشتراک گذاری" placement="top" arrow={false}>
                  <div role="share" className="flex cursor-pointer items-center justify-center text-gray-500">
                    <ShareOutlined style={{ fontSize: 28 }} />
                  </div>
                </Tooltip>
              </div>
              {/* view */}
              <div className="grid w-full grid-cols-1 gap-2 sm:grid-cols-2 lg:w-56 lg:grid-cols-1">
                <div className=" bg-secondary p-2 text-center">رزرو بازدید حضوری</div>
                <div className=" bg-gray-400 p-2 text-center">رزرو بازدید آنلاین</div>
              </div>
              <div className="flex w-full flex-row gap-2 lg:w-auto">
                <div className="flex w-full flex-col items-center ">
                  <span>ثبت شده توسط IRANOCC</span>
                  <b>اکبر قلیوف</b>
                  <hr className="my-2 w-full border-gray-500" />
                  <span>شماره تماس</span>
                  <b>09212728307</b>
                </div>
                <div className="flex items-center justify-center">
                  <Image
                    //
                    src="https://storage.iranocc.com/user/O1erYiC0r1glsun9.png"
                    width={80}
                    height={80}
                    style={{ borderRadius: "50%" }}
                    alt="user"
                  />
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </>
  );
}
